Repository: OmegaT-L10N/es
Catalog: tm/auto/CO-ES1.tmx
Source language: en
Languages: es

source: - comparative, nominative, masculine, feminine, neutral, resp. Plural form of the adjective
es: - comparativo, nominativo, masculino, femenino, neutro, adjetivo en su forma plural de cortesía

source: 1.1. Search options
es: 1.1. Opciones de búsqueda

source: 1. Shortcuts customization
es: 1. Personalización de atajos de teclado

source: 1. OmegaT sites and OmegaT SourceForge project
es: 1. Páginas OmegaT y proyecto de OmegaT SourceForge

source: 1. Introduction
es: 1. Introducción

source: 1. Search window
es: 1. Buscar ventana

source: 2. Bug reports
es: 2. Informe de errores

source: 2. Languages selection
es: 2. Selección de lenguas

source: 2. Project Menu
es: 2. Proyecto

source: 2. Use
es: 2. Uso

source: 2. User settings files
es: Manual de usuario...

source: 3.2. Search window
es: 1. Buscar ventana

source: 3. Contributing to OmegaT project
es: 3. Contribuyendo a OmegaT proyecto

source: 3. Edit Menu
es: 3. Editar

source: 3. Scripting languages
es: 3. Scripting languages (lenguaje de programación)

source: 4. GoTo Menu
es: 4. Dirigirse a

source: 5. View Menu
es: 5. Ver

source: 6. Tools Menu
es: 6. Herramientas

source: 7. Options Menu
es: 7. Opciones

source: 8. Help Menu
es: 8. Ayuda

source: [2] The full syntax for keystrokes (shortcuts) is defined in the following Java 1.6 documentation from Oracle (bottom of page): Java 1.6 keystrokes shortcuts
es: [2] Toda la sintaxis para los atajos de teclado está definida en la documentación siguiente sobre Java 1.6, extraída de Oracle (final de página): Java 1.6 atajos de teclado

source: [3] On the Mac, the modifier meta must be used to specify the command key.
es: [3] En el Mac, el modificador meta tiene que ser usado para especificar la tecla de comando.

source: [4] The possible keyevents (keys) are listed in the following Java 1.6 documentation from Oracle: Java 1.6 keyEvents description
es: [4] Los posibles keyevents (teclas) están listados en la documentación siguiente sobre Java 1.6, extraída de Oracle: Java 1.6 descripción de keyEvents

source: [5] The default OmegaT shortcuts are available from Sourceforge: Default OmegaT Shortcuts
es: [5] Los atajos predeterminados de OmegaT esstán disponibles en Sourceforge: Atajos predeterminados de OmegaT

source: Prev
es: Anterior

source: <event> can be: typed, pressed, released
es: <event> puede ser: typed, pressed, released

source: <modifier> can be: shift, control, ctrl, meta[3], alt, altGraph
es: <modifier> puede ser: shift, control, ctrl, meta[3], alt, altGraph

source: Close: close the window without any change.
es: Cerrar: cierre la ventana sin realizar ningún cambio.

source: Groovy (http://groovy.codehaus.org): is a dynamic language for the Java Virtual machine.
es: Groovy(http://groovy.codehaus.org): Es una lengua dinámica para la máquina virtual Java.

source: JavaScript (sometimes abbreviated JS, not to be confused with Java): is a prototype-based scripting language that is dynamic, weakly typed and has first-class functions.
es: JavaScript (a veces abreviado JS, para no ser confundido con Java): es un lenguaje de script basado en prototipos y es dinámico, débilmente tipado (es decir, de cumplimiento flexible de las reglas de escritura) y tiene funciones de primera clase.

source: Replace All: operates replacement of all occurrences (after displaying a confirmation window where the number of occurrences is shown).
es: Reemplazar todo: realice la sustitución de todos los resultados (después de mostrar una ventana de confirmación donde se muestra el número de resultados).

source: Replace: operates a "one by one" replacement, by the mean of buttons in the header of the Editor pane.
es: Reemplaza: realice una sustitución "uno por uno", mediante los botones o el encabezamiento del panel Editor.

source: OmegaT sites and OmegaT SourceForge project
es: OmegaT páginas y OmegaT SourceForge proyecto

source: <shortcut> must be of the following form: 0 or more <modifier> followed by 0 or 1 <event> followed by 1 <key>, where:
es: shortcut “<” y “>” tiene que tener esta estructura: 0 o más <modifier> seguido por 0 o 1 <event> seguido por <key>, donde:

source: A stemmer for English, for example, should identify the string "cats" (and possibly "catlike", "catty" etc.) as based on the root "cat", and "stemmer", "stemming", "stemmed" as based on "stem".
es: Un "stemmer" en inglés, por ejemplo, tendría que identificar la cadena "cats" (y posiblemente "catlike", "catty", (debería ir una coma aunque no esté en el TO) etc.) al basarse en la raíz "cat", y "stemmer", "stemming", "stemmed" al basarse en "stem".

source: A stemming algorithm reduces the words "fishing", "fished", "fish", and "fisher" to the root word, "fish".
es: Un algoritmo stemming reduce las palabras "fishing", "fished", "fish", y "fisher" a la palabra raíz, "fish".

source: About...
es: Acerca de...

source: All the languages have access to the OmegaT object model, with the project as the top object.
es: Todos los lenguajes tienen acceso al modelo de objetos de OmegaT, en el que el proyecto es el objeto más importante. .

source: Always Confirm Quit
es: Siempre Confirmar Salir

source: Anything after the "//" will be ignored.
es: Lo que vaya después del "//" será ignorado.

source: Appendix C. OmegaT Team Projects
es: Apéndice C. OmegaT Proyectos en Equipo

source: Appendix D. Tokenizers
es: Apéndice D. Tokenizers (analizadores léxicos)

source: Appendix E. LanguageTool plugin
es: Apéndice E. Herramienta de Lenguaje plugin

source: Appendix F. Scripts
es: Apéndice F. Scripts

source: Appendix G. OmegaT on the web
es: Apéndice G. OmegaT en la web

source: Appendix H. Shortcuts customization
es: Apéndice H. Personalización de atajos de teclado

source: Appendix I. Legal notices
es: Apéndice I. Aviso legal

source: Auto-completion/Auto-text...
es: Autocompleción/Autotexto...

source: Auto-completion/Character Table...
es: Autocompleción/Autotexto...

source: Auto-completion/Glossary...
es: Autocompleción/Glosario...

source: Back in history...
es: Atrás en historia...

source: Being the language behind popular software such as Firefox it is a familiar and preferred programming tool in the open-source domain.
es: Es el lenguaje que hay detrás de scftwares populares como Firefox y es una herramienta conocida que una gran parte de personas elige en el ámbito del código abierto.

source: Borrowing an example from Slovenian, here "good" in all possible grammatically correct forms:
es: Si tomamos prestado un ejemplo del esloveno, estos serían todas las formas posibles y gramaticalmente correctas de la palabra "bien":

source: Bug reports
es: Informe de errores

source: By default, scripts are stored in the "scripts" folder located in OmegaT installation folder (the folder that contains the OmegaT.jar).
es: Por defecto, los scripts están almacenados en la carpeta "scripts" localizada en OmegaT carpeta de instalación (la carpeta que contiene el OmegaT.jar).

source: Chapter 15. Searches
es: Capítulo 15. Búsquedas

source: Chapter 16. Search and Replace
es: Capítulo 16. Buscar y reemplazar

source: Chapter 17. Regular expressions
es: Capítulo 17. Expresiones regulares

source: Click Replace Next or Skip, then end the replacement session with Finish.
es: Haga clic en Reemplazar siguiente u Omitir, y entonces acabe el procedimiento de sustitución con Fin.

source: Clicking Tools > Scripting opens the Scripting window:
es: Herramientas > Se abre la ventana Scripts:

source: Close
es: Cerrar

source: Contributing to OmegaT project
es: Contribuyendo a OmegaT proyecto

source: Create Alternative Translation
es: Crear Traducción Alternativa

source: Create Current Translated Documents
es: Crear Documentos traducidos actuales

source: Create Glossary Entry
es: Crear Entrada de Glosario

source: Create Translated Documents
es: Crear Documentos traducidos

source: Cycle Case To...
es: Cycle Case a...

source: Default shortcut
es: Atajo predeterminado

source: Display Source Segments
es: Segmentos de Fuente de exhibición

source: Download Team Project
es: Descargar Proyecto en Equipo

source: Edit Menu
es: Editar

source: Editing Behavior...
es: Editar Funcionamiento...

source: Empty lines are accepted and comment lines should start with "//".
es: Las líneas vacías están aceptadas y la líneas de comentario deberían empezar con "//".

source: Enter the new word or phrase (regular expressions are not supported) in the Replace with box, then click one of the following options:
es: Introduzca la palabra o frase nueva que no son compatibles con las expresiones regulares) en el cuadro Reemplazar, y luego haga clic en una de las opciones siguientes:

source: Except one: check Untranslated in order to operate Search and replace also on segments that have not been translated yet.
es: Excepto una: compruebe Untranslated para utilizar las opciones Buscar y reemplazar también en segmentos que no han sido traducidos todavía.

source: Export Selection
es: Exportar Seleccioón

source: External TMXs...
es: TMXs Externos...

source: File Filters...
es: Filtros de archivo...

source: Font...
es: Fuente...

source: For example, in the default OmegaT shortcuts[5], one can find:
es: Por ejemplo, en los atajos[5] por defecto de OmegaT, uno puede encontrar:

source: For the latest version of OmegaT, refer to the downloads page at www.omegat.org.
es: Para la última versión de OmegaT, consulte la página de descargas en www.omegat.org.

source: Forward in history...
es: Adelante en historia...

source: GoTo Menu
es: Dirigirse a

source: Help Menu
es: Ayuda

source: Home
es: Inicio

source: If no replacement is done to a given segment, the target segment will be “emptied”, i.e., it will remain untranslated.
es: Si no se ha hecho ninguna sustitución en un segmento dado, el segmento objetivo será “vaciado”, es decir, queda sin traducir.

source: If they do not conflict with system shortcuts, they should be available from within OmegaT.
es: Si no chocan con atajos de sistema, tendrían que ser disponibles de dentro de OmegaT.

source: If you are on a Mac and you want to add a Shift+Command+S shortcut to Tools → Statistics, add the following line to your MainMenuShortcuts.properties:
es: Si es usuario de un Mac y quiere añadir Shift+Comando+S como atajo de Herramientas → Estadísticas, y añada la línea siguiente a MainMenuShortcuts.properties:

source: If you want to use Shift+Ctrl+O to open a project, modify your MainMenuShortcuts.properties as follows:
es: Si quiere usar Shift+Ctrl+O para abrir un proyecto, modifique su archivo MainMenuShortcuts.properties así:

source: If you wish to keep track of what is happening to the report, register as a SourceForge user, login and file a bug report or simply click Monitor at the top of the report.
es: Si desea mantener un seguimiento de la evolución del informe, regístrese como usuario en SourceForge, inicies sesión y archive un informe de errores o simplemente haga clic en la parte superior del informe.

source: If you would like to help support the continued development of OmegaT, it would be very much appreciated - click on this link to go to the OmegaT PayPal account.
es: Valoraremos mucho cualquier aportación que haga para apoyar el desarrollo continuado de OmegaT. Haga clic en este enlace para ir a la cuenta PayPal de OmegaT.

source: Import From MediaWiki...
es: Importar de MediaWiki...

source: Import Source Files...
es: Importar archivos fuente...

source: In case no tokenizer exists for the current languages, OmegaT uses Hunspell instead (in that case, make sure that relevant Hunspell dictionaries are installed).
es: En caso de que no exista ningún tokenizer exista para las lenguas actuales, OmegaT usa en su lugar Hunspell en cambio (en este caso, asegúrese que los diccionarios Hunspell relevantes estén instalados).

source: In the above example, two scripts (position 1 and 2) have already been added.
es: En el ejemplo de arriba, dos scripts (posición 1 y 2) ya han sido añadidos.

source: Incompatibilities
es: Incompatibilidades

source: Insert Match
es: Insertar Coincidencia

source: Insert Next Missing Tag
es: Insertar La Siguiente Etiqueta Ausente

source: Insert Source
es: Insertar Fuente

source: Insert Source Tags
es: Insertar Etiquetas Fuente

source: Introduction
es: Introducción

source: It builds upon the strengths of Java but has additional power features inspired by languages like Python, Ruby and Smalltalk.
es: Se construye a partir del funcionamiento de Java pero tiene grandes características adicionales inspiradas en lenguajes como Python, Ruby y Smalltalk.

source: It is a multi-paradigm language, supporting object-oriented, imperative, and functional programming styles.
es: Es una lengua multi-paradigma, un soporte orientado a la programación por objetos, imperativo y con estilos de programación funcionales.

source: It is possible to select another tokenizer (Language Tokenizer) or a different version of the tokenizer (Tokenizer Behavior) from the Project Properties window.
es: Es posible seleccionar otro tokenizer (analizador léxico de la lengua de partida o de llegada) o una versión diferente del tokenizer (Tokenizer Behaviour) de la ventana de Propiedades del Proyecto.

source: Languages selection
es: Selección de lenguas

source: Last Changes...
es: Últimos Cambios...

source: Load a script into the editor by clicking on its name in the list on the left panel.
es: Cargue un script en el editor haciendo clic en su nombre en la lista en el tablero izquierdo.

source: Log...
es: Registro...

source: Machine Translate
es: Traducción Automáticae

source: Mark Non-Unique Segments
es: Segmentos No Únicos Marcados

source: Mark Non-breakable Spaces
es: Espacios Irrompibles Marcados

source: Mark Segments with Notes
es: Segmentos Marcados con Notas

source: Mark Translated Segments
es: Segmento traducido marcado

source: Mark Untranslated Segments
es: Segmentos no traducidos marcados

source: Mark Whitespace
es: Whitespace Marcado

source: Match Statistics
es: Estadística de Coincidencias

source: Match Statistics per File
es: Estadística de Coincidencias por Archivo

source: Menu Item
es: Elemento de menú

source: Menu Item Code
es: Código de Elemento del menú

source: More can be found in the Painless Bug Tracking article by Joel Spolsky.
es: Puede encontrar más información Painless Bug Tracking artículo de Joel Spolsky.

source: Most of the items that appear in the main menu can have a new shortcut assigned.
es: La mayoría de los elementos que aparecen en el menú principal pueden tener un atajo nuevo asignado.

source: New
es: Nuevo

source: Next
es: Siguiente

source: Next Note
es: Siguiente Nota

source: Next Segment
es: Siguiente Segmento

source: Next Translated Segment
es: Siguiente Segmento Traducido

source: Next Untranslated Segment
es: Siguiente Segmento No Traducido

source: Note that bug reports and requests for enhancements are publicly visible, so you should not add any sensitive files.
es: Observe que los informes de error y las propuestas de mejora son públicas, así que no debería añadir ningún contenido confidencial.

source: OmegaT 3.1 - User's Guide
es: Grupo de usuario.OmegaT 3.1 - User's Guid

source: OmegaT allows to run scripts written in different scripting languages.
es: OmegaT permite ejecutar los guiones escritos en diferentes lenguajes de guión.

source: OmegaT automatically selects a tokenizer for the source and the target language according to the language settings of the project.
es: OmegaT selecciona automáticamente un tokenizer para la fuente y la lenguameta según la configuración de las lenguas del proyecto.

source: OmegaT will not launch if tokenizers are found in the /plugin folder.
es: OmegaT no arrancará si hay tokenizers en la carpeta /plugin .

source: Once the MainMenuShortcuts.properties file is modified, OmegaT must be relaunched to take the new shortcuts into account.
es: Una vez el archivo MainMenuShortcuts.properties esté modificado, OmegaT tiene que ser reiniciado para que tenga en cuenta los atajos.

source: Open
es: Abrir

source: Open the Search and replace window with Ctrl+K and enter the word or expression you wish to replace in the Search for box.
es: Abra la ventana Buscar y reemplazar con Ctrl +K e introduzca la palabra o expresión que desea reemplazar en la cuadro de Búsqueda

source: Options Menu
es: Opciones

source: Previous Note
es: Nota anterior

source: Previous Segment
es: Segmento anterior

source: Project Files...
es: Archivos de proyecto...

source: Project Menu
es: Proyecto

source: Properties...
es: Propiedades...

source: Proxy Login...
es: Acceso representativo...

source: Quit
es: Salir

source: Redo Last Action
es: Rehacer Última Acción

source: Register Identical Translation
es: Registrar Traducción Idéntica

source: Reload
es: Recargar

source: Remember that every good bug report needs just three things:
es: Recuerde que todo buen informe de errores necesita sólo tres cosas:

source: Remove all the tokenizers from the /plugin folder before starting OmegaT.
es: Saque todos los tokenizers de la carpeta /plugin antes de iniciar OmegaT.

source: Replace With Match
es: Reemplazar Con Coincidencia

source: Replace With Source
es: Reemplazar Con Fuente

source: Replace with Machine Translation
es: Reemplazar con Traducción automática

source: Restore Main Window
es: Restaurar Ventana Principal

source: Right-click on a button from "<1>" to "<12>" in the bottom panel and select "Add".
es: Pulse con el botón derecho del ratón en una opción del "<1>" a "<12>" del tablero inferior y seleccione "Añadir".

source: Save
es: Guardar

source: Save then the file and relaunch OmegaT.
es: Guarda el archivo y relanza OmegaT.

source: Saving and Output...
es: Guardar y Producto...

source: Scripting languages
es: Lenguajes de guión

source: Search Project...
es: Buscar Proyecto...

source: Search and Replace...
es: Buscar y Reemplazar...

source: Search options
es: Opciones de búsqueda

source: Search options are similar to the ones displayed in Search window.
es: Las opciones de búsqueda son similares a las mostrados en la ventana de Búsqueda.

source: Search window
es: Busacar ventana

source: Segment number...
es: Número de segmento...

source: Segmentation...
es: Segmentación...

source: Select Fuzzy Match 1
es: Selecciona Coincidencia Parcial 1

source: Select Fuzzy Match 2
es: Selecciona Coincidencia Parcial 2

source: Select Fuzzy Match 3
es: Selecciona Coincidencia Parcial 3

source: Select Fuzzy Match 4
es: Selecciona Coincidencia Parcial 4

source: Select Fuzzy Match 5
es: Selecciona Coincidencia Parcial 5

source: Select Next Match
es: Selecciona Coincidencia Siguiente

source: Select Previous Match
es: Selecciona Coincidencia Anterior

source: Shortcuts customization
es: Atajos de teclado

source: Spell checking...
es: Corrector ortográfico...

source: Statistics
es: Estadísticas

source: Steps to reproduce
es: Pasos que ha seguido

source: Switch Case To/Lower Case
es: Cambiar a minúscula

source: Switch Case To/Title Case
es: Cambiar a tipo título

source: Switch Case To/Upper Case
es: Cambiar a mayúscula

source: Table H.1. Project Menu
es: Tabla H.1. Proyecto

source: Table H.2. Edit Menu
es: Tabla H.2. Editar

source: Table H.3. GoTo Menu
es: Tabla H.3. Dirigirse a

source: Table H.4. View Menu
es: Tabla H.4. Ver

source: Table H.5. Tools Menu
es: Tabla H.5. Herramientas

source: Table H.6. Options Menu
es: Tabla H.6. Opciones

source: Table H.7. Help Menu
es: Tabla H.7. Ayuda

source: Tag Validation...
es: Validación de Etiquetas ...

source: Team...
es: Equipo...

source: The FAQ is a good starting point for finding answers to questions you may have.
es: El PMF es un punto de partida bueno para encontrar respuestas a cuestiones que usted puede tener.

source: The Scripting window allows you to load an existing script into the text area and run it against the current opened project.
es: La ventana Scripts le permite cargar un scripts existente en el área de texto y ejecutarlo en el proyecto en curso.

source: The default OmegaT shortcuts for the Mac are also available from Sourceforge, they all use "meta" instead of "ctrl": Default OmegaT Shortcuts for the Mac
es: Los atajos predeterminados de OmegaT para Mac están también disponibles en Sourceforge, todos utilizan "meta" en vez de "ctrl": Atajos predeterminados de OmegaT para el Mac

source: The first is the shortcut for Open Project, the second for Create Glossary Entry.
es: El primero es el atajo para Abrir Proyecto, el segundo para Crear Entrada de Glosario.

source: The following code snippet in groovy for instance scans through all the segments in all files in the current project and, if the translation exists, prints out the source and the target of the segment:
es: El siguiente fragmento de código en groovy por ejemplo busca entre todos los segmentos de todos los archivos del proyecto en curso y, si la traducción existe, imprime el original y la traducción del segmento:

source: The following scripting languages have been implemented:
es: Los siguientes lenguajes de script han sido implementados:

source: The shortcut definition file must be named MainMenuShortcuts.properties and must contain at most one shortcut definition per line.
es: El archivo de definición del atajo debe llamarseMainMenuShortcuts.properties y debe contener como máximo una definición de atajo por línea.

source: The shortcut definition syntax is the following: <menu item code>=<shortcut>, where <menu item code> is a code taken from the tables below and <shortcut> is a combination of pressed keys specified by the user[2].
es: La sintaxis de definición del atajo es la siguiente: <menu item code>=<shortcut>, donde <menu item code> es un código tomado de las tablas de abajo y <shortcut> es una combinación de teclas pulsadas especificadas por el usuario[2].

source: The OmegaT web site contains links to numerous OmegaT resources.
es: La página OmegaT contiene enlaces a numerosos recursos OmegaT.

source: Then click on Search button to display all the corresponding occurrences.
es: Entonces haga clic en Búsqueda para visualizar todos los resultados correspondientes.

source: They also improve glossary matching.
es: También mejoran las coincidencias del glosario.

source: This is especially useful in case of languages that use pre- and postfix forms for the stem words.
es: Esto es especialmente útil en el caso de lenguas que usan formas prefijadas y sufijadas para crear palabras flexivas.

source: To contribute to OmegaT:
es: Para contribuir a OmegaT:

source: To customize the script feature, do the following:
es: Para personalizar las característica de scripts, haga lo siguiente:

source: To get involved in the OmegaT development effort you can join the developer group, via the web or by sending an email to omegat-development-request@lists.sourceforge.net with "subscribe" as the subject line.
es: Para formar parte del desarrollo de OmegaT puede unirse al grupo de desarrolladores, a través de la web o enviando un correo electrónico a omegat-development-request@lists.sourceforge.net con la palabra "suscribe" en el asunto.

source: To make it possible (although Search and replace operates only on memory), OmegaT will copy the source segment to the target segment before the replace operation occurs.
es: Para hacerlo posible (a pesar de que Buscar y reemplazar opera sólo en la memoria), OmegaT copiará el segmento fuente al segmento objetivo antes de que se realice la operación de reemplazar.

source: To support the OmegaT project financially
es: Para apoyar el proyecto OmegaT economicamente

source: To translate OmegaT's user interface, user manual or other related documents:
es: Para traducirla la interfaz de usuario de OmegaT, manual de usuario u otros documentos relacionados:
